Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS60/svd/PIC32CM1216LS60100.svd
               <register>
                  <name>INTENSET</name>
                  <description>Interrupt Enable Set</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Non-Secure Check Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>Interrupt Flag Status and Clear</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Non-Secure Check</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NONSEC</name>
                  <description>Security Attribution</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NONSEC</name>
                        <description>Port Security Attribution</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NSCHK</name>
                  <description>Security Attribution Check</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NSCHK</name>
                        <description>Port Security Attribution Check</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_SEC</name>
         <prependToName>PORT_SEC_</prependToName>
         <baseAddress>0x40003200</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_IOBUS</name>
         <prependToName>PORT_IOBUS_</prependToName>
         <baseAddress>0x60000000</baseAddress>
      </peripheral>
      <peripheral derivedFrom="PORT">
         <name>PORT_IOBUS_SEC</name>
         <prependToName>PORT_IOBUS_SEC_</prependToName>
         <baseAddress>0x60000200</baseAddress>
      </peripheral>
      <peripheral>
         <name>PTC</name>
         <version>U22155.0.0</version>
         <description>Peripheral Touch Controller</description>
         <groupName>PTC</groupName>
         <prependToName>PTC_</prependToName>
         <baseAddress>0x42004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1</size>
            <usage>reserved</usage>
         </addressBlock>
         <interrupt>
            <name>PTC</name>
            <value>67</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>RSTC</name>
         <version>U22393b0</version>
         <description>Reset Controller</description>
         <groupName>RSTC</groupName>
         <prependToName>RSTC_</prependToName>
         <baseAddress>0x40000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RCAUSE</name>
               <description>Reset Cause</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power On Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD12</name>
                     <description>Brown Out VDDCORE Detector Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD33</name>
                     <description>Brown Out VDDIO Detector Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BOD12PLL</name>
                     <description>Brown Out VDDCORE_PLL Detector Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXT</name>
                     <description>External Reset</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDT</name>
                     <description>Watchdog Reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYST</name>
                     <description>System Reset Request</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
